Q: What does HTML stand for?

A: HyperText Markup Language.
Q: What is the purpose of the HTML <head> element?

A: The <head> element contains meta-information about the HTML document, such as title, character set, styles, and scripts.
Q: Explain the difference between <div> and <span> in HTML.

A: <div> is a block-level element used for grouping other elements, while <span> is an inline element used for applying styles to a specific part of text.
Q: How do you create a hyperlink in HTML?

A: Using the <a> (anchor) element. Example: <a href="https://example.com">Visit Example</a>.
Q: What is the purpose of the HTML <DOCTYPE> declaration?

A: It specifies the document type and version of HTML to the browser.
Q: Explain the difference between <ol> and <ul> elements.

A: <ol> is used for ordered (numbered) lists, and <ul> is used for unordered (bulleted) lists.
Q: What is the purpose of the HTML <meta charset="UTF-8"> tag?

A: It sets the character encoding for the document to UTF-8, which supports a wide range of characters.
Q: How can you embed an image in HTML?

A: Using the <img> element. Example: <img src="image.jpg" alt="Description">.
Q: What is the purpose of the HTML <form> element?

A: It is used to create an HTML form for user input.
Q: Explain the difference between <article> and <section> elements.

A: <article> is used for independent, self-contained content, while <section> is used for grouping related content.
Q: How can you add a comment in HTML?

A: Using <!-- This is a comment -->.
Q: What does the alt attribute in the <img> tag do?

A: It provides alternative text for the image, which is displayed if the image cannot be loaded.
Q: What is the purpose of the HTML <iframe> element?

A: It is used to embed another document within the current HTML document.
Q: How do you create a line break in HTML?

A: Using the <br> tag.
Q: What is the HTML5 canvas element used for?

A: It is used for drawing graphics, animations, or other visual elements on the web page.
Q: What is semantic HTML?

A: Semantic HTML uses tags that carry meaning about the structure and content of the page, such as <header>, <footer>, and <nav>.
Q: Explain the purpose of the target attribute in the <a> tag.

A: It specifies where to open the linked document. Common values include _blank (opens in a new tab or window) and _self (opens in the same tab or window).
Q: How can you create a numbered list in HTML?

A: Using the <ol> (ordered list) element.
Q: What is the purpose of the HTML <figcaption> element?

A: It is used to provide a caption or description for the content of a <figure> element.
Q: Explain the difference between <id> and <class> attributes in HTML.

A: The id attribute is used to uniquely identify a single HTML element, while the class attribute is used to group multiple elements that share the same styles or behavior.
CSS Questions and Answers:

Q: What does CSS stand for?

A: Cascading Style Sheets.
Q: How can you include CSS in an HTML document?

A: Using the <link> element in the <head> section or the <style> element within the <head> or <body> section.
Q: Explain the difference between margin and padding in CSS.

A: Margin is the space outside the border of an element, while padding is the space inside the border of an element.
Q: What is the box model in CSS?

A: The box model describes how elements are rendered on a web page, including content, padding, border, and margin.
Q: How do you center an element horizontally in CSS?

A: Use margin: auto; or text-align: center; for inline elements.
Q: What is the purpose of the CSS z-index property?

A: It specifies the stacking order of positioned elements. Elements with a higher z-index value are displayed on top.
Q: How can you select all paragraphs with the class "intro" in CSS?

A: Use the selector p.intro.
Q: What is the difference between display: block; and display: inline;?

A: display: block; makes an element a block-level element, taking up the full width available, while display: inline; makes it an inline element, only taking up as much width as necessary.
Q: How can you hide an element in CSS?

A: Use display: none; or visibility: hidden;.
Q: What is the purpose of the CSS float property?

A: It is used to specify whether an element should float to the left or right of its container, allowing text and inline elements to wrap around it.
Q: Explain the difference between position: relative; and position: absolute;.

A: position: relative; positions an element relative to its normal position, while position: absolute; positions it relative to its nearest positioned ancestor.
Q: How can you add a background image in CSS?

A: Use the background-image property. Example: background-image: url('image.jpg');
Q: What is the purpose of the CSS box-sizing property?

A: It determines whether an element's width and height include padding and border or not. Values include content-box (default) and border-box.
Q: How do you change the text color of an element in CSS?

A: Use the color property. Example: color: #333;
Q: What is the purpose of the CSS transition property?

A: It adds a smooth transition effect to a specified CSS property when it changes.
Q: How can you select all even or odd elements with CSS?

A: Use the :even or :odd pseudo-classes. Example: tr:nth-child(even) { background-color: #f2f2f2; }
Q: Explain the purpose of the CSS flexbox layout.

A: Flexbox is a layout model that allows design of complex layouts and distribution of space within a container, even when the size of the items is unknown or dynamic.
Q: What is the purpose of the CSS @media rule?

A: It is used to apply different styles for different devices or screen sizes, creating responsive designs.
Q: How can you set a fixed background image that doesn't scroll with the page?

A: Use the background-attachment: fixed; property.
Q: Explain the purpose of the CSS opacity property.

A: It sets the transparency level for an element, with values from 0 (completely transparent) to 1 (completely opaque).

